// Задача 21 - HARD необязательная
// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними 
// в N-мерном пространстве. 
// Сначала задается N с клавиатуры, потом задаются координаты точек


Console.WriteLine("Введите N");
int n= Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите координату х1 и у1");
int x1 = Convert.ToInt32(Console.ReadLine());
int y1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите координату х2 и у2");
int x2 = Convert.ToInt32(Console.ReadLine());
int y2 = Convert.ToInt32(Console.ReadLine());

