// задача 40 - HARD необязательная. На вход программы подаются три целых положительных числа. 
// Определить , является ли это сторонами треугольника. Если да, то вывести всю информацию
//  по нему - площадь, периметр, значения углов треугольника в градусах, является ли он прямоугольным, 
//  равнобедренным, равносторонним.

Console.WriteLine("Введите  число a");
int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите  число b");
int b = Convert.ToInt32(Console.ReadLine());
  
Console.WriteLine("Введите  число c");
int c = Convert.ToInt32(Console.ReadLine());

